results/testing.txt/ab-5-10-testing.txt.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.16.101 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        172.16.16.101
Server Port:            8889

Document Path:          /testing.txt
Document Length:        22 bytes

Concurrency Level:      5
Time taken for tests:   9.494 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      1590 bytes
HTML transferred:       220 bytes
Requests per second:    1.05 [#/sec] (mean)
Time per request:       4746.772 [ms] (mean)
Time per request:       949.354 [ms] (mean, across all concurrent requests)
Transfer rate:          0.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  209 440.5      1    1045
Processing:  1924 2639 565.6   2732    3440
Waiting:     1924 2552 573.1   2482    3440
Total:       1925 2848 507.5   3042    3440

Percentage of the requests served within a certain time (ms)
  50%   3042
  66%   3083
  75%   3254
  80%   3321
  90%   3440
  95%   3440
  98%   3440
  99%   3440
 100%   3440 (longest request)